snlkuharlocal/src/DataProcessors/ЗагрузкаСотрудников/ЗагрузкаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаСотрудников</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Уволенные</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>табВыплаты</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>табВыплат</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКБазе77</name>
    <type>
      <types>ValueList</types>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Загрузка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ЛицевыеСчетаРаботниковОрганизации/ЛицевыеСчетаРаботниковОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛицевыеСчетаРаботниковОрганизации</name>
  <resources>
    <name>НомерЛицевогоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВид</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДокументыУдостоверяющиеЛичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДатаВыдачи</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКемВыдан</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКодПодразделения</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВУ</name>
    <comment>Номер водительского удостоверения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение (Периодический реквизит)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штатный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕМэйл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешениеОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗатрат</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительныйПадеж</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АссистентМенеджера</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПодразделенияУСО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомерСотрудникаЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускВездеход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПродаж</name>
    <comment>Работник склада забронирован данным подразделением ЦО</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОдобренСБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ЗагрузкаСотрудников/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	ЗаписатьВЛог("Загрузка сотрудников","Начало. Пользователь: "+ИмяПользователя()+", компьютер: "+ИмяКомпьютера(),"Информация");
	
	ЕЕ="EE";
	ЕС="ES";
	Организация = Справочники.ФизическиеЛица.НайтиПоКоду("SNL-00849");
	Уволенные = Справочники.ФизическиеЛица.НайтиПоКоду("SNL-00918");
//	ЗаписатьВЛог("Загрузка сотрудников",Логин,"Информация");
Если ПустаяСтрока(Логин) Тогда
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//Логин = "*%*%*%";
		//Пароль = "*$*$*$";
		Логин = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКЗУП_ЕЕ).Логин;
		Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКЗУП_ЕЕ).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
	КонецЕсли;
//	ЗаписатьВЛог("Загрузка сотрудников",Логин,"Информация");
//крохин начало 25.03.2022
	//СтрокаСоединения = "Srvr=""srvbuh"";Ref=""ZUP_EE"";";
	СтрокаСоединения = "Srvr=""SRV1C"";Ref=""ZUP_EE"";";
//крохин конец 25.03.2022	
	           
	Попытка	
		//крохин начало 02.05.2017
		//теперь 8.3
		//Соединение = Новый COMОбъект("V82.COMConnector");
		Соединение = Новый COMОбъект("V83.COMConnector");
		//крохин конец 02.05.2017
		База_Ист = Соединение.Connect(СтрокаСоединения + "Usr=""" + Логин + """;Pwd=""" + Пароль + """;");
	Исключение                 
		//крохин начало 26.09.2013
		ЗаписатьВЛог("Загрузка сотрудников","Ошибка установки соединения с 8.* ! " + ОписаниеОшибки(),"Информация");
		#Если Клиент Тогда
			Сообщить("Ошибка установки соединения с 8.* ! " + ОписаниеОшибки(), СтатусСообщения.Важное);
		#КонецЕсли
		//крохин конец 26.09.2013
		Возврат;
		
	КонецПопытки;
	
	// получаем данные из 8.2
	Запрос_Ист = База_Ист.NewObject("Запрос");
	Запрос_Ист.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ВТ_РаботающиеСотрудники
	|ИЗ
	|	Справочник.СотрудникиОрганизаций
	|ГДЕ
	|	ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|	И ДатаПриемаНаРаботу <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) 
	|	И (ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	ИЛИ началоПериода(ДатаУвольнения,день) > &Текдата)
	|	И (НЕ ПометкаУдаления)
	|	И (НЕ ЭтоГруппа)
	|
	|СГРУППИРОВАТЬ ПО
	|	Физлицо
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиОрганизаций.Физлицо.Код КАК Код,
    |	СотрудникиОрганизаций.Код КАК КодЗуп,
	|	СотрудникиОрганизаций.ТекущееПодразделениеОрганизации.Код КАК КодПодр,	
	|	СотрудникиОрганизаций.Физлицо.Наименование КАК Наименование,
	|	СотрудникиОрганизаций.ТекущееПодразделениеОрганизации.Наименование КАК Подразделение,
	|	СотрудникиОрганизаций.ТекущаяДолжностьОрганизации.Наименование КАК Должность,
	|	СотрудникиОрганизаций.ДатаУвольнения как ДатаУвольнения
	|ИЗ
	|	ВТ_РаботающиеСотрудники КАК ВТ_РаботающиеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ПО ВТ_РаботающиеСотрудники.Ссылка = СотрудникиОрганизаций.Ссылка";
	
	
	Запрос_Ист.установитьПараметр("Текдата",НачалоДня(текущаяДата()));
	Выборка_Ист = Запрос_Ист.Выполнить().Выбрать();
	
	
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Код");
	Табл.Колонки.Добавить("КодПодр");
	Табл.Колонки.Добавить("Наименование");
	Табл.Колонки.Добавить("Подразделение");
	Табл.Колонки.Добавить("Тип");
	Табл.Колонки.Добавить("Должность");
	Табл.Колонки.Добавить("ДатаУвольнения");
	Табл.Колонки.Добавить("ТабЗуп");

	Пока Выборка_Ист.Следующий() Цикл
		
		//Если Выборка_Ист.ДатаУвольнения>ТекущаяДата() тогда
		//	продолжить;
		//КонецЕсли;	
			
		НоваяСтрока = Табл.Добавить();
		НоваяСтрока.Код				= ЕЕ + СокрЛП(Выборка_Ист.Код);
		НоваяСтрока.КодПодр			= ЕС + СокрЛП(Выборка_Ист.КодПодр);
		НоваяСтрока.Наименование	= СокрЛП(Выборка_Ист.Наименование);
		НоваяСтрока.Подразделение	= СокрЛП(Выборка_Ист.Подразделение);
		НоваяСтрока.Тип				= "элемент";
		НоваяСтрока.Должность		= СокрЛП(Выборка_Ист.Должность);
		НоваяСтрока.ДатаУвольнения	= СокрЛП(Выборка_Ист.ДатаУвольнения);
		//нечаева 22,09,22+++
		НоваяСтрока.ТабЗуп	= СокрЛП(Выборка_Ист.кодЗуп);
		//нечаева 22,09,22---
	КонецЦикла;
	
	База_Ист = Неопределено;
	
	Если Табл.Количество() = 0 Тогда
		#Если Клиент Тогда
			Сообщить("Ошибка получения данных из Базы 8.2.");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	ЗаписатьВЛог("Загрузка сотрудников", "загружена информация из 8.2", "Информация");
	
	// загружаем в нашу базу.
	ЗагрузитьФЛ(Табл);
	

	#Если Клиент Тогда
		Сообщить("Данные загружены!");
	#КонецЕсли
	ЗаписатьВЛог("Загрузка сотрудников","Окончание","Информация");
КонецПроцедуры


Процедура ЗагрузитьФЛ(ТЗ) 
	
	СписокПринятыхСотрудников = Новый СписокЗначений;
	СписокУволенныхСотрудников = Новый СписокЗначений;
	СписокКривыхСотрудников = Новый СписокЗначений;
	СписокУзловПолучателей=Новый Массив;
	КБСТИЛЬ = Справочники.Подразделения.НайтиПоКоду("SSP-0013");
	
	ВыборкаУзловОбмена=ПланыОбмена.Основной.Выбрать();
	Пока ВыборкаУзловОбмена.Следующий() Цикл
		Если ВыборкаУзловОбмена.Ссылка <> ПараметрыСеанса.ЭтотУзел Тогда
			СписокУзловПолучателей.Добавить(ВыборкаУзловОбмена.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	СЗ = Новый СписокЗначений;
	Сч = 1;
	Для каждого ТекСтрока Из ТЗ Цикл
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			состояние(ТекСтрока.Наименование);
		#КонецЕсли
		
		СтрокаКода = ТекСтрока.Код;
		СтрокаКодаГруппы = ТекСтрока.КодПодр;
		СтрокаКодаПодразделения = Прав(СтрокаКодаГруппы,СтрДлина(СтрокаКодаГруппы)-2);  //-2
		ФизЛица = Справочники.ФизическиеЛица;
		НайденнаяСсылка = ФизЛица.НайтиПоРеквизиту("ТабельныйНомер",СтрокаКода);
		Если НайденнаяСсылка = ФизЛица.ПустаяСсылка() Тогда
			
			Группа = ФизЛица.НайтиПоРеквизиту("ТабельныйНомер",СтрокаКодаГруппы);
			
			Если Группа.ЭтоГруппа Тогда
				// 
				
				ФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
				ФизЛицо.Наименование = ТекСтрока.Наименование;
				ФизЛицо.ТабельныйНомер = ТекСтрока.Код;
				
				ФизЛицо.Родитель = Группа;
				//
			иначе
				Группа = Справочники.ФизическиеЛица.СоздатьГруппу();
				Группа.Наименование = ТекСтрока.Подразделение;
				Группа.ТабельныйНомер = ТекСтрока.КодПодр;
				Группа.Записать();
				ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,Группа);
				
				Группа = ФизЛица.НайтиПоРеквизиту("ТабельныйНомер",СтрокаКодаГруппы);
				//
				ФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
				ФизЛицо.Наименование = ТекСтрока.Наименование;
				ФизЛицо.ТабельныйНомер = ТекСтрока.код;
				// нечаева 22,09,22+++
				ФизЛицо.ТабельныйНомерСотрудникаЗУП = ТекСтрока.ТабЗуп;
				// нечаева 22,09,22--
				ФизЛицо.Родитель = Группа;
				//
			КонецЕсли; 
			//подр новый
			Если СокрЛП(Организация.код) = "SNL-00756" Тогда  // кб стиль
				Если ФизЛицо.Подразделение <> КБСТИЛЬ Тогда
					ФизЛицо.Подразделение = КБСТИЛЬ;
				КонецЕсли;
				
			иначе
				Подразделение = Справочники.Подразделения.НайтиПоКоду(СтрокаКодаПодразделения);
				
				Если ПустаяСтрока(Подразделение) Тогда
					#Если Клиент Тогда
						сообщить("Нет подразделения по сотруднику "+ФизЛицо.Наименование+". Код:"+СтрокаКодаГруппы);
					#КонецЕсли
				иначе
					Если ФизЛицо.Подразделение <> Подразделение Тогда
						ФизЛицо.Подразделение = Подразделение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//должность
			Должность = Справочники.Должности.НайтиПоНаименованию(ТекСтрока.Должность,Истина);
			Если Должность = Справочники.Должности.ПустаяСсылка() Тогда
				Должность = Справочники.Должности.СоздатьЭлемент();
				Должность.Наименование = ТекСтрока.должность;
				Должность.Записать();
				Должность = Должность.Ссылка;
			КонецЕсли;
			Если ФизЛицо.Должность <> Должность Тогда
				ФизЛицо.Должность = Должность;
			КонецЕсли;
			
			Если не ФизЛицо.Штатный Тогда
				ФизЛицо.Штатный = Истина;
			КонецЕсли;
			Если ФизЛицо.Модифицированность() Тогда
				
				ФизЛицо.Записать();
				ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ФизЛицо);
				СписокПринятыхСотрудников.Добавить(ФизЛицо);
			КонецЕсли;
			
			СтрокаСЗ = ФизЛицо.Ссылка;
			
			СЗ.Добавить(СтрокаСЗ,СтрокаСЗ,Истина);
			#Если Клиент Тогда
				Сообщить(строка(ФизЛицо) + " // " + строка(ФизЛицо.Родитель) + " принят");
			#КонецЕсли
		Иначе
			Группа = ФизЛица.НайтиПоРеквизиту("ТабельныйНомер",СтрокаКодаГруппы);
			
			Если Группа.ЭтоГруппа Тогда
				ФизЛицо = НайденнаяСсылка.ПолучитьОбъект();
				Если ФизЛицо.Родитель <> Группа Тогда
					ФизЛицо.Родитель = Группа; 
				КонецЕсли;
			Иначе
				Группа = Справочники.ФизическиеЛица.СоздатьГруппу();
				Группа.Наименование = ТекСтрока.Подразделение;
				Группа.ТабельныйНомер = ТекСтрока.КодПодр;
				
				Группа.Записать();
				ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,Группа);
				Группа = ФизЛица.НайтиПоРеквизиту("ТабельныйНомер",СтрокаКодаГруппы);
				ФизЛицо = НайденнаяСсылка.ПолучитьОбъект();
				
				ФизЛицо.Родитель = Группа;
			КонецЕсли;
			
			Если СокрЛП(Организация.код) = "SNL-00756" Тогда  // кб стиль
				Если ФизЛицо.Подразделение <> КБСТИЛЬ Тогда
					ФизЛицо.Подразделение = КБСТИЛЬ;
				КонецЕсли;
			иначе
				Подразделение = Справочники.Подразделения.НайтиПоКоду(СтрокаКодаПодразделения);
				Если ПустаяСтрока(Подразделение) Тогда
					#Если Клиент Тогда
						сообщить("Нет подразделения по сотруднику "+ФизЛицо.Наименование+". Код:"+СтрокаКодаГруппы);
					#КонецЕсли
					СписокКривыхСотрудников.Добавить(ФизЛицо);
				иначе
					Если ФизЛицо.Подразделение <> Подразделение Тогда
						ФизЛицо.Подразделение = Подразделение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			//должность
			Должность = Справочники.Должности.НайтиПоНаименованию(ТекСтрока.Должность,Истина);
			Если Должность = Справочники.Должности.ПустаяСсылка() Тогда
				Должность = Справочники.Должности.СоздатьЭлемент();
				Должность.Наименование = ТекСтрока.должность;
				Должность.Записать();
				Должность = Должность.Ссылка;
			КонецЕсли;
			Если ФизЛицо.Должность <> Должность Тогда
				ФизЛицо.Должность = Должность;
			КонецЕсли;
			
			Если НЕ ФизЛицо.Штатный Тогда
				ФизЛицо.Штатный = Истина;
			КонецЕсли;
			СтрокаСЗ = ФизЛицо.Ссылка;
			СЗ.Добавить(СтрокаСЗ,СтрокаСЗ,Истина);
			Если ФизЛицо.Наименование <> ТекСтрока.Наименование Тогда
				ФизЛицо.Наименование = ТекСтрока.Наименование;
			КонецЕсли;
			
			// нечаева 22,09,22+++
			Если ФизЛицо.ТабельныйНомерСотрудникаЗУП <> ТекСтрока.ТабЗуп Тогда
				ФизЛицо.ТабельныйНомерСотрудникаЗУП = ТекСтрока.ТабЗуп;
			КонецЕсли;
			// нечаева 22,09,22--
			
			Если ФизЛицо.Модифицированность() Тогда
				ФизЛицо.Записать();
				ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ФизЛицо);
				СписокПринятыхСотрудников.Добавить(ФизЛицо);
			КонецЕсли;
			//Сообщить(ФизЛицо);
			
		КонецЕсли;
		
		Сч = Сч + 1;
	КонецЦикла;
	#Если Клиент Тогда
		сообщить("Загрузка списка сотрудников завершена.");
	#КонецЕсли
	
	//----------------------------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка  КАК ФизЛицо
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ЭтоГруппа = Ложь
	//    |	И ФизическиеЛица.Штатный = Истина
	|	И ФизическиеЛица.Ссылка В ИЕРАРХИИ(&Организация)";
	Запрос.УстановитьПараметр("Организация",Организация);
	выборка = Запрос.Выполнить().Выбрать();
	пока выборка.Следующий() Цикл
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		Если СЗ.НайтиПоЗначению(выборка.ФизЛицо) = Неопределено Тогда
			
			ФизЛицо = выборка.ФизЛицо.ПолучитьОбъект();
			Если ФизЛицо.штатный Тогда
				ФизЛицо.Штатный = Ложь;
			КонецЕсли;
			#Если Клиент Тогда
				сообщить(строка(ФизЛицо) + " // " + строка(ФизЛицо.Родитель) + " уволен");
			#КонецЕсли
			Если ФизЛицо.Родитель <> Уволенные Тогда
				ФизЛицо.Родитель = Уволенные;
				ФизЛицо.Должность = Справочники.Должности.ПустаяСсылка();
			КонецЕсли;
			Если ФизЛицо.Модифицированность() Тогда
				
				ФизЛицо.Записать();
				ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ФизЛицо);
				СписокУволенныхСотрудников.Добавить(ФизЛицо);
			КонецЕсли;	
		Иначе
			
			ФизЛицо = выборка.ФизЛицо.ПолучитьОбъект(); 
			
			Если ПустаяСтрока(ФизЛицо.ШтрихКод) И  ФизЛицо.Штатный Тогда
				
				ФизЛицо.ШтрихКод = ПолучитьШКФизЛица();
				#Если Клиент Тогда
					сообщить("прописан ШК " + ФизЛицо.Наименование); 
				#КонецЕсли
				Если ФизЛицо.Модифицированность() Тогда
					ФизЛицо.Записать();
					ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ФизЛицо);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	//письмо
	ТекстПисьма = "";
	
	Для СЧ = 0 По СписокПринятыхСотрудников.Количество()-1 Цикл
		Сотрудник = СписокПринятыхСотрудников.Получить(СЧ).Значение;
		ТекстПисьма = ТекстПисьма + " Принят: "+Сотрудник +". Подразделение: "+Сотрудник.Подразделение+"."+ Символы.ВК;
	КонецЦикла;
	Для СЧ = 0 По СписокУволенныхСотрудников.Количество()-1 Цикл
		Сотрудник = СписокУволенныхСотрудников.Получить(СЧ).Значение;
		ТекстПисьма = ТекстПисьма + " Уволен: "+Сотрудник +". Подразделение: "+Сотрудник.Подразделение+"."+Символы.ВК;
	КонецЦикла;
	Для СЧ = 0 По СписокКривыхСотрудников.Количество()-1 Цикл
		Сотрудник = СписокКривыхСотрудников.Получить(СЧ).Значение;
		//крохин начало 06.01.2012
		//ТекстПисьма = ТекстПисьма + " Неверное подразделение по сотруднику: "+Сотрудник;
		ТекстПисьма = ТекстПисьма + " Неверное подразделение по сотруднику: "+Сотрудник+"."+Символы.ВК;
		//крохин конец 06.01.2012
	КонецЦикла;
	
	//крохин начало 03.07.2019
	//загрузка лицевых счетов
	
	#Если Клиент Тогда
			
			состояние("загрузка лицевых счетов");
		#КонецЕсли
		
	ЕЕ="EE";
	ЕС="ES";
	Сбербанк = Справочники.Контрагенты.НайтиПоКоду("SSP-0564");
	ЕЕЭ = Справочники.Организации.НайтиПоКоду("SS-001");
 //   ЗаписатьВЛог("Загрузка сотрудников",Логин,"Информация");
	 Если ПустаяСтрока(Логин) Тогда
		 // Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//Логин = "*%*%*%";
		//Пароль = "*$*$*$";
		Логин = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКЗУП_ЕЕ).Логин;
		Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКЗУП_ЕЕ).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
	КонецЕсли;
//	ЗаписатьВЛог("Загрузка сотрудников",Логин,"Информация");
	//крохин начало 25.03.2022
	//СтрокаСоединения = "Srvr=""srvbuh"";Ref=""ZUP_EE"";";
	СтрокаСоединения = "Srvr=""SRV1C"";Ref=""ZUP_EE"";";
//крохин конец 25.03.2022
	
	Попытка	
		//крохин начало 02.05.2017
		//теперь 8.3
		//Соединение = Новый COMОбъект("V82.COMConnector");
		Соединение = Новый COMОбъект("V83.COMConnector");
		//крохин конец 02.05.2017
		База_Ист = Соединение.Connect(СтрокаСоединения + "Usr=""" + Логин + """;Pwd=""" + Пароль + """;");
	Исключение                 
		//крохин начало 26.09.2013
		ЗаписатьВЛог("Загрузка сотрудников","Ошибка установки соединения с 8.* ! " + ОписаниеОшибки(),"Информация");
		#Если Клиент Тогда
			Сообщить("Ошибка установки соединения с 8.* ! " + ОписаниеОшибки(), СтатусСообщения.Важное);
		#КонецЕсли
		//крохин конец 26.09.2013
		Возврат;
		
	КонецПопытки;
	


		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка,
	               |	ФизическиеЛица.ТабельныйНомер,
	               |	ЛицевыеСчетаРаботниковОрганизации.НомерЛицевогоСчета
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
	               |		ПО ЛицевыеСчетаРаботниковОрганизации.ФизЛицо = ФизическиеЛица.Ссылка
	               |ГДЕ
	               |	ФизическиеЛица.Штатный
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	
	РезультатЗапроса = Запрос.Выполнить();			   
	Выборка = РезультатЗапроса.Выбрать();
	
	ТаблицаТабельныхНомеров = Новый ТаблицаЗначений;
	ТаблицаТабельныхНомеров.Колонки.Добавить("ТабельныйНомер");
	ТаблицаТабельныхНомеров.Колонки.Добавить("ФизЛицо");
	ТаблицаТабельныхНомеров.Колонки.Добавить("НомерЛицевогоСчета");
	
	СписокТабельныхНомеров = База_Ист.NewObject("СписокЗначений");
	
	Пока выборка.Следующий() Цикл
		Если не ПустаяСтрока(выборка.ТабельныйНомер) Тогда
		НоваяСтрокаТаблицыТабельныхНомеров = ТаблицаТабельныхНомеров.Добавить();
		НоваяСтрокаТаблицыТабельныхНомеров.ТабельныйНомер = Прав(Выборка.ТабельныйНомер,СтрДлина(Выборка.ТабельныйНомер)-2);
		НоваяСтрокаТаблицыТабельныхНомеров.ФизЛицо = выборка.Ссылка;
		НоваяСтрокаТаблицыТабельныхНомеров.НомерЛицевогоСчета = выборка.НомерЛицевогоСчета;
		СписокТабельныхНомеров.Добавить(НоваяСтрокаТаблицыТабельныхНомеров.ТабельныйНомер);
		КонецЕсли;
	КонецЦикла;
	


	
	// получаем данные из 8.2
	Запрос_Ист = База_Ист.NewObject("Запрос");
	Запрос_Ист.Текст = "ВЫБРАТЬ
|	ЛицевыеСчетаРаботниковОрганизации.ФизЛицо.Код,
|	ЛицевыеСчетаРаботниковОрганизации.НомерЛицевогоСчета,
|   ЛицевыеСчетаРаботниковОрганизации.ФизЛицо.Код КАК ТабельныйНомер
|	ИЗ
|	РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
|ГДЕ
|	ЛицевыеСчетаРаботниковОрганизации.ФизЛицо.Код В (&СписокТабельныхНомеров)
|АВТОУПОРЯДОЧИВАНИЕ";
   Запрос_Ист.УстановитьПараметр("СписокТабельныхНомеров",СписокТабельныхНомеров);
   ВыборкаИст = Запрос_Ист.выполнить().выбрать();
   
   
   ЗагруженоЛицевыхСчетов = 0;
   
   Пока ВыборкаИст.Следующий() Цикл 

	   НайденнаяСтрока = ТаблицаТабельныхНомеров.Найти(ВыборкаИст.ТабельныйНомер,"ТабельныйНомер");
	   
//	   Если НЕ ПустаяСтрока(Выборка.НомерЛицевогоСчета) И Выборка.НомерЛицевогоСчета <> ВыборкаИст.НомерЛицевогоСчета Тогда
//		    Если Лев(Выборка.НомерЛицевогоСчета,20) <> Лев(ВыборкаИст.НомерЛицевогоСчета,20) Тогда
Если НайденнаяСтрока = Неопределено ИЛИ Лев(НайденнаяСтрока.НомерЛицевогоСчета,20) <> Лев(ВыборкаИст.НомерЛицевогоСчета,20) Тогда

//		   Сообщить("" + Выборка.Ссылка + "//" +Выборка.НомерЛицевогоСчета + "//"+ ВыборкаИст.НомерЛицевогоСчета);
		   Наборзаписей = РегистрыСведений.ЛицевыеСчетаРаботниковОрганизации.СоздатьНаборЗаписей();
		   Наборзаписей.Отбор.ФизЛицо.Значение = НайденнаяСтрока.ФизЛицо;
		   Наборзаписей.Отбор.ФизЛицо.Использование = Истина;
		   Наборзаписей.Очистить();
		   Запись = Наборзаписей.Добавить();
		   запись.Организация = ЕЕЭ;
		   запись.ФизЛицо = НайденнаяСтрока.ФизЛицо;
		   Запись.Банк = Сбербанк;
		   запись.НомерЛицевогоСчета = ВыборкаИст.НомерЛицевогоСчета;
		   Наборзаписей.Записать();
		 //  Прервать;
		 ЗагруженоЛицевыхСчетов = ЗагруженоЛицевыхСчетов + 1;
	   КонецЕсли;

   КонецЦикла;
   

База_Ист = Неопределено;

ТекстПисьма = Символы.ВК + ТекстПисьма + Символы.ВК + "Загружено лицевых счетов: "+ЗагруженоЛицевыхСчетов;


	//крохин конец 03.07.2019
	
	Если НЕ ПустаяСтрока(ТекстПисьма) Тогда
		ПослатьПисьмо(ТекстПисьма);	
	КонецЕсли;
	
	
	//сообщить("обработка завершена");
	
КонецПроцедуры

Функция ПолучитьШКФизЛица()
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 4, 9) КАК НомерШК
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ 
	|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 1, 3)=""777""
	|УПОРЯДОЧИТЬ ПО 
	|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 4, 9) УБЫВ";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерШК =  Число(Выборка.НомерШК);	
	Иначе
		НомерШК = "000000000";
	КонецЕсли; 
	
	НомерШК=НомерШК+1;
	ШтрихКод = "777" + Формат(НомерШК,"ЧЦ=9; ЧРГ=; ЧВН=; ЧГ=0");
	ШтрихКод = ШтрихКод + КонтрольныйСимволEAN(Число(ШтрихКод),13);
	Возврат ШтрихКод;
КонецФункции


Процедура ПослатьПисьмо(Текст) 
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль,ПараметрыПочты);	
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПочтовыйПрофиль.Пользователь       = "*%*%*%";
	//ПочтовыйПрофиль.Пароль             = "*$*$*$";
	ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	ПочтовыйПрофиль.ВремяОжидания      = 60; 
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	
	Сообщение.Получатели.Добавить("krohin@collant.ru");
	
	//крохин начало 08.04.2016
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	//Сообщение.Получатели.Добавить("nikolaev@collant.ru");
	//крохин конец 08.04.2016
	//	Сообщение.Получатели.Добавить("zhuravlev@collant.ru");
	//	Сообщение.Получатели.Добавить("pokidyshev@collant.ru");
	//	Сообщение.Получатели.Добавить("kuhar@collant.ru");
	// Кухарь А.Ю. 23.12.2021 начало
	// Смирнов М.Ю. 12.08.2025 HELP-6450 начало
	//Сообщение.Получатели.Добавить("kovalenko@collant.ru");
	//Сообщение.Получатели.Добавить("saraikina@collant.ru");
	// Смирнов М.Ю. 12.08.2025 HELP-6450 конец
	Сообщение.Получатели.Добавить("ryabchenko@collant.ru");
	Сообщение.Получатели.Добавить("filippov@collant.ru");
	// Смирнов М.Ю. 12.08.2025 HELP-6450 начало
	//Сообщение.Получатели.Добавить("afanasev_m@collant.ru");
	// Смирнов М.Ю. 12.08.2025 HELP-6450 конец
	// Кухарь А.Ю. 23.12.2021 конец	
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тема = "Уведомление службы сопровождения пользователей департамента IT";
	Сообщение.Тексты.Добавить(Текст);
	
	Почта = Новый ИнтернетПочта(); 
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		Сообщить(ОписаниеОшибки()); 
		Возврат; 
	КонецПопытки; 
	
	Почта.Подключиться(ПочтовыйПрофиль);
	Почта.Послать(Сообщение);
	Почта.Отключиться();
	
	
КонецПроцедуры
